### Terraform Plan Results

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "example-prod-bucket-008151864528"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment"  = "production"
          + "Name"         = "Production Example Bucket"
          + "TestPipeline" = "prod-test"
        }
      + tags_all                    = {
          + "Environment"  = "production"
          + "ManagedBy"    = "Terraform"
          + "Name"         = "Production Example Bucket"
          + "Project"      = "terraform-infrastructure"
          + "TestPipeline" = "prod-test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + account_id  = "008151864528"
  + bucket_name = (known after apply)

```

</details>

*Environment: prod*
*Pushed by: @bringoneops*